app/controllers/heros_controller.rb

SELECT "heros".* FROM "heros" ORDER BY "heros"."id" ASC
---
    def index
      heroes = Hero.order(id: :asc)

SELECT "heros".* FROM "heros" WHERE "heros"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_hero
      @hero = Hero.find(params[:id])