app/controllers/powers_controller.rb

    def index
      @powers = Power.order(id: :asc)
---
SELECT "powers".* FROM "powers" ORDER BY "powers"."id" ASC

      def set_power
        @power = Power.find(params[:id])
---
SELECT "powers".* FROM "powers" WHERE "powers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]